{"text": "Thank you for trying our generative AI tools!\n\n\n\nIn your usage, you must adhere to our [Content Policy](https://labs.openai.com/policies/content-policy):\n\n\n\n**Do not attempt to create, upload, or share images that are not G-rated or that could cause harm.**\n\n\n* **Hate:** hateful symbols, negative stereotypes, comparing certain groups to animals/objects, or otherwise expressing or promoting hate based on identity.\n* **Harassment:** mocking, threatening, or bullying an individual.\n* **Violence:** violent acts and the suffering or humiliation of others.\n* **Self-harm:** suicide, cutting, eating disorders, and other attempts at harming oneself.\n* **Sexual:** nudity, sexual acts, sexual services, or content otherwise meant to arouse sexual excitement.\n* **Shocking:** bodily fluids, obscene gestures, or other profane subjects that may shock or disgust.\n* **Illegal activity:** drug use, theft, vandalism, and other illegal activities.\n* **Deception:** major conspiracies or events related to major ongoing geopolitical events.\n* **Political:** politicians, ballot-boxes, protests, or other content that may be used to influence the political process or to campaign.\n* **Public and personal health:** the treatment, prevention, diagnosis, or transmission of diseases, or people experiencing health ailments.\n* **Spam:** unsolicited bulk content.\n\n**Don’t mislead your audience about AI involvement.**\n\n\n* When sharing your work, we encourage you to proactively disclose AI involvement in your work.\n* You may remove the DALL·E signature if you wish, but you may not mislead others about the nature of the work. For example, you may not tell people that the work was entirely human generated or that the work is an unaltered photograph of a real event.\n\n**Respect the rights of others.**\n\n\n* Do not upload images of people without their consent.\n* Do not upload images to which you do not hold appropriate usage rights.\n* Do not create images of public figures.\n", "title": "Are there any restrictions to how I can use DALL·E 2? Is there a content policy?", "article_id": "6338764", "url": "https://help.openai.com/en/articles/6338764-are-there-any-restrictions-to-how-i-can-use-dall-e-2-is-there-a-content-policy"}