{"text": "The DALL·E editor interface helps you edit images through inpainting and outpainting, giving you more control over your creative vision.\n\n\n\n![](https://downloads.intercomcdn.com/i/o/571871271/eb4c662a2316d5cf2f753c60/Screen+Shot+2022-08-30+at+2.40.28+PM.png)The editor interface is in beta – there are a number of things to keep in mind while using this interface:\n\n\n* The newest editor experience is only available on desktop at the moment, we'll be rolling out these features to smaller screens in the coming months.\n* Expanded images are not currently saved automatically, make sure to download your incremental work often to avoid losing anything.\n* You cannot yet save expanded images to a collection or view the full image in your history, but we hope to add this soon.\n* For very large images, your browser may experience lag while downloading. Make sure to download often to avoid losing work due to browser freezes!\n\nThe FAQ below will help you learn how to get the most out of these new tools:\n\n\n\nHow do I access the DALL·E editor?\n==================================\n\n\nOnce you're logged in on a desktop device, you can launch the editor in two ways:\n\n\n* **Start with an image**: From any image on the DALL-E website, you can click the \"Edit\" button to drop into an editor with that image as the starting point.\n* **Start with a blank canvas:** If you'd prefer to start from scratch, you can bookmark and use the following URL: https://labs.openai.com/editor\n\nWhile users on mobile devices don't have access to advanced editor features like outpainting, you can still inpaint images by tapping \"Edit\" on an existing image you've generated or uploaded.\n\n\n\nHow much does usage of the DALL·E editor cost?\n==============================================\n\n\nLike DALL·E's other functionality, each prompt you submit by clicking the \"Generate\" button will deduct one credit from your credit balance (regardless of how many pixels you are filling in).\n\n\n\nYou can always purchase additional credits from the user dropdown at the top right of the application.\n\n\n\nHow do I use the editor most effectively?\n=========================================\n\n\nThe **Generation frame** contains the image context that the model will see when you submit a text prompt, so make sure that it contains enough useful context for the area you are expanding into, otherwise the style may drift from the rest of your image.\n\n\n\n![](https://downloads.intercomcdn.com/i/o/571876595/9e431c455e24421079bee9d3/Screen+Shot+2022-08-30+at+2.55.38+PM.png)You can simultaneously **Erase** parts of your image to touch up or replace certain areas, and perfect the finer details.\n\n\n\nYou can also **Upload** existing images, optionally resize them, and then place them within the canvas to bring additional imagery into the scene. This is a powerful feature that enables you to fuse images together, connect opposite ends of an image for loops, and \"uncrop\" images that you can combine with other tooling to create recursively expanding animations.\n\n\n\nThe **Download** tool will export the latest state of the artwork as .png file. We recommend downloading often to keep snapshots of your work. You can always re-upload previous snapshots to continue where you left off.\n\n\n\nWhat keyboard shortcuts are supported?\n======================================\n\n\nThe editor supports keyboard shortcuts for zooming, switching tools, undo/redo, and more. Press **?** while using the editor to show the full list of keyboard shortcuts.\n\n\n\nAre there any other tips & tricks to be aware of?\n=================================================\n\n\n* Start with the character before the landscape, if there are characters involved, so you can get the body morphology right before filling the rest.\n* Make sure you're keeping enough of the existing image in the generation frame to avoid the style drifting too much.\n* Ask DALL·E for a muted color palette, especially as you stray further from the center, to avoid oversaturation and color-blasting.\n* Consider what story you’re trying to tell when picking the direction you want to expand the image into.\n\n\n\n", "title": "DALL·E Editor Guide", "article_id": "6516417", "url": "https://help.openai.com/en/articles/6516417-dall-e-editor-guide"}