{"text": "1. **How much does it cost to use ChatGPT?**\n\n\n\t* The research preview of ChatGPT is free to use.\n2. **How does ChatGPT work?**\n\n\n\t* ChatGPT is fine-tuned from GPT-3.5, a language model trained to produce text. ChatGPT was optimized for dialogue by using Reinforcement Learning with Human Feedback (RLHF) – a method that uses human demonstrations and preference comparisons to guide the model toward desired behavior.\n3. **Why does the AI seem so real and lifelike?** \n\n\n\t* These models were trained on vast amounts of data from the internet written by humans, including conversations, so the responses it provides may sound human-like. It is important to keep in mind that this is a direct result of the system's design (i.e. maximizing the similarity between outputs and the dataset the models were trained on) and that such outputs may be inaccurate, untruthful, and otherwise misleading at times.\n4. **Can I trust that the AI is telling me the truth?**\n\n\n\t* ChatGPT is not connected to the internet, and it can occasionally produce incorrect answers. It has limited knowledge of world and events after 2021 and may also occasionally produce harmful instructions or biased content.\n\t\n\t\n\t\n\tWe'd recommend checking whether responses from the model are accurate or not. If you find an answer is incorrect, please provide that feedback by using the \"Thumbs Down\" button.\n5. **Who can view my conversations?**\n\n\n\t* As part of our commitment to safe and responsible AI, we review conversations to improve our systems and to ensure the content complies with our policies and safety requirements.\n6. **Will you use my conversations for training?**\n\n\n\t* Yes. Your conversations may be reviewed by our AI trainers to improve our systems.\n7. **Can you delete my data?**\n\n\n\t* Yes, please follow the [data deletion process](https://help.openai.com/en/articles/6378407-how-can-i-delete-my-account).\n8. **Can you delete specific prompts?**\n\n\n\t* No, we are not able to delete specific prompts from your history. Please don't share any sensitive information in your conversations.\n9. **Can I see my history of threads? How can I save a conversation I’ve had?**\n\n\n\t* Yes, you can now view and continue your past conversations.\n10. **Where do you save my personal and conversation data?**\n\n\n\t* For more information on how we handle data, please see our [Privacy Policy](https://openai.com/privacy/) and [Terms of Use](https://openai.com/api/policies/terms/).\n11. **How can I implement this? Is there any implementation guide for this?**\n\n\n\t* Developers can [now](https://openai.com/blog/introducing-chatgpt-and-whisper-apis) integrate ChatGPT into their applications and products through our API. Users can expect continuous model improvements and the option to choose dedicated capacity for deeper control over the models. To learn more, please check out the documentation [here](https://platform.openai.com/docs/api-reference/chat).\n12. **Do I need a new account if I already have a Labs or Playground account?**\n\n\n\t* If you have an existing account at [labs.openai.com](https://www.google.com/url?q=http://labs.openai.com&sa=D&source=docs&ust=1669833084818742&usg=AOvVaw3xrSlGIVLLVKjnchqinjLs) or [beta.openai.com](https://www.google.com/url?q=http://beta.openai.com&sa=D&source=docs&ust=1669833084818875&usg=AOvVaw11EJaho-h4CU4I-OMT7x3j), then you can login directly at [chat.openai.com](https://www.google.com/url?q=http://chat.openai.com&sa=D&source=docs&ust=1669833084818926&usg=AOvVaw13rLwSrAYiV5hOL5oPsYDq) using the same login information. If you don't have an account, you'll need to sign-up for a new account at [chat.openai.com](https://www.google.com/url?q=http://chat.openai.com&sa=D&source=docs&ust=1669833084818980&usg=AOvVaw3_WRKLYk-Z3bm-D1EABgkJ).\n13. **Why did ChatGPT give me an answer that’s not related to my question?**\n\n\n\t* ChatGPT will occasionally make up facts or “hallucinate” outputs. If you find an answer is unrelated, please provide that feedback by using the \"Thumbs Down\" button\n14. **Can I use output from ChatGPT for commercial uses?**\n\n\n\t* Subject to the [Content Policy](https://labs.openai.com/policies/content-policy) and [Terms](https://openai.com/api/policies/terms/), you own the output you create with ChatGPT, including the right to reprint, sell, and merchandise – regardless of whether output was generated through a free or paid plan.\n15. **I accidentally provided incorrect information during sign-up and now I'm unable to complete the process. How can I fix this issue?**\n\n\n\t* Please reach out to our support team by initiating a new conversation using the on-site chat tool at help.openai.com. We'll be happy to help!\n", "title": "What is ChatGPT?", "article_id": "6783457", "url": "https://help.openai.com/en/articles/6783457-what-is-chatgpt"}