{"text": "1. **What is ChatGPT Plus?**\n\n\n\t1. ChatGPT Plus is a subscription plan for ChatGPT. It offers availability even when demand is high, faster response speed, and priority access to new features.\n2. **Is the free version still available?** \n\n\n\t1. Yes, free access to ChatGPT will still be provided. By offering this subscription pricing, we will be able to help support free access availability to as many people as possible. See our [general ChatGPT article](https://help.openai.com/en/articles/6783457-chatgpt-faq) for more information on our free offering.\n3. **How can I cancel my subscription?**\n\n\n\t1. You may cancel your subscription at any time. Click “My Account” in the [sidebar](https://chat.openai.com/chat). Then click “Manage my subscription” in the pop-up window. You’ll be directed to a Stripe checkout page where you can select “Cancel Plan”. Your cancellation will take effect the day after the next billing date. You can continue using our services until then. To avoid being charged for your next billing period, cancel your subscription at least 24 hours before your next billing date. Subscription fees are non-refundable.\n4. **What is the refund policy?**\n\n\n\t1. If you live in the EU, UK, or Turkey, you’re eligible for a refund if you cancel your subscription within 14 days of purchase. Please send us a message via our chat widget in the bottom right of your screen in our [Help Center](https://help.openai.com/en/), select the \"Billing\" option and select \"I need a refund\".\n5. **How can I request a VAT tax refund?**\n\n\n\t1. Please send us a message via our chat widget in the bottom right of your screen in our [Help Center](https://help.openai.com/en/), select the \"Billing\" option and then select \"VAT exemption request\". Be sure to include your billing information (name, email, and billing address) so we can process your request faster.\n6. **My account got terminated. Can I get a refund?**\n\n\n\t1. If we terminate your account for violating our Terms of Use, you still owe any unpaid fees, and will not be given a refund for any remaining credit or prepaid service.\n7. **How can I opt out my data to improve model performance?**\n\n\n\t1. Please fill out [this form](https://docs.google.com/forms/d/e/1FAIpQLScrnC-_A7JFs4LbIuzevQ_78hVERlNqqCPCt3d8XqnKOfdRdQ/viewform). Additionally, you may request your account to be [deleted](https://help.openai.com/en/articles/6378407-how-can-i-delete-my-account) at any time.\n8. **Where can I find my invoice for ChatGPT Plus?**\n\n\n\t1. Receipts for credit purchases made are sent to the email address you used when making the purchase. You may also view your invoices from the sidebar by clicking \"My Account\" and then \"Manage my subscription\".\n9. **Are alternate payment options available?**\n\n\n\t1. At this time, we only accept payment via credit card.\n10. **I want to use ChatGPT Plus with sensitive data. Who can view my conversations?**\n\n\n\t1. As part of our commitment to safe and responsible AI, we may review conversations to improve our systems and to ensure the content complies with our policies and safety requirements. For more information on how we handle data, please see our [Privacy Policy](https://openai.com/privacy/) and [Terms of Use](https://openai.com/terms/).\n11. **Is the ChatGPT API included in the ChatGPT Plus subscription?**\n\n\n\t1. No, the ChatGPT API and ChatGPT Plus subscription are billed separately. The API has its own pricing, which can be found at <https://openai.com/pricing>. The ChatGPT Plus subscription covers usage on chat.openai.com only and costs $20/month.\n12. **I am using the free subscription of ChatGPT so does that mean I can use the ChatGPT API for free too?**\n\n\n\t1. No, API usage is it's own separate cost. The ChatGPT API is not available for free. See our [Pricing](https://openai.com/pricing) page for details.\n\n", "title": "What is ChatGPT Plus?", "article_id": "6950777", "url": "https://help.openai.com/en/articles/6950777-what-is-chatgpt-plus"}