{
  "text": "**Introducing the GPT Store and ChatGPT Team plan (Jan 10, 2024)**\n------------------------------------------------------------------\n\n\n#### Discover what’s trending in the GPT Store\n\n\nThe store features a diverse range of GPTs developed by our partners and the community. Browse popular and trending GPTs on the community leaderboard, with categories like DALL·E, writing, research, programming, education, and lifestyle. \n\n\n\nExplore GPTs at chat.openai.com/gpts.\n\n\n#### Use ChatGPT alongside your team\n\n\nWe’re launching a new ChatGPT plan for teams of all sizes, which provides a secure, collaborative workspace to get the most out of ChatGPT at work. \n\n\n\nChatGPT Team offers access to our advanced models like GPT-4 and DALL·E 3, and tools like Advanced Data Analysis. It additionally includes a dedicated collaborative workspace for your team and admin tools for team management. As with ChatGPT Enterprise, you own and control your business data — we do not train on your business data or conversations, and our models don’t learn from your usage. More details on our data privacy practices can be found on our [privacy page](https://openai.com/enterprise-privacy) and [Trust Portal](https://trust.openai.com/).\n\n\n\nYou can learn more about the ChatGPT Team plan [here](https://openai.com/chatgpt/team).\n\n\n\n**ChatGPT with voice is available to all users (November 21, 2023)**\n--------------------------------------------------------------------\n\n\nChatGPT with voice is now available to all free users. Download the app on your phone and tap the headphones icon to start a conversation.\n\n\n\n**Introducing GPTs (November 6, 2023)**\n---------------------------------------\n\n\nYou can now create custom versions of ChatGPT that combine instructions, extra knowledge, and any combination of skills. Learn more [here](https://openai.com/blog/introducing-gpts).\n\n\n\nWe’re rolling out custom versions of ChatGPT that you can create for a specific purpose—called GPTs. GPTs are a new way for anyone to create a tailored version of ChatGPT to be more helpful in their daily life, at specific tasks, at work, or at home—and then share that creation with others. For example, GPTs can help you [learn the rules to any board game, help teach your kids math, or design stickers](https://openai.com/chatgpt#do-more-with-gpts). \n\n\n\nPlus and Enterprise users can start creating GPTs this week. Later this month, we’ll launch the GPT Store, so people can feature and make money from their GPTs. We plan to offer GPTs to more users soon.\n\n\n\n**Browsing is now out of beta (October 17, 2023)**\n--------------------------------------------------\n\n\nBrowsing, which we re-launched a few weeks ago, is moving out of beta.\n\n\n\nPlus and Enterprise users no longer need to switch the beta toggle to use browse, and are able to choose \"Browse with Bing\" from the GPT-4 model selector.\n\n\n\n**DALL·E 3 is now rolling out in beta (October 16, 2023)**\n----------------------------------------------------------\n\n\nWe’ve integrated DALL·E 3 with ChatGPT, allowing it to respond to your requests with images. From a simple sentence to a detailed paragraph, ask ChatGPT what you want to see and it will translate your ideas into exceptionally accurate images.\n\n\n\nTo use DALL·E 3 on both web and mobile, choose DALL·E 3 in the selector under GPT-4. The message limit may vary based on capacity.\n\n\n\n**Browsing is rolling back out to Plus users (September 27, 2023)**\n-------------------------------------------------------------------\n\n\nBrowsing is rolling out to all Plus users. ChatGPT can now browse the internet to provide you with current and authoritative information, complete with direct links to sources. It is no longer limited to data before September 2021. \n\n\n\nTo try it out, enable Browsing in your beta features setting.\n\n\n* Click on 'Profile & Settings’\n* Select 'Beta features'\n* Toggle on ‘Browse with Bing’\n\nChoose Browse with Bing in the selector under GPT-4.\n\n\n\n**New voice and image capabilities in ChatGPT (September 25, 2023)**\n--------------------------------------------------------------------\n\n\nWe are beginning to roll out new voice and image capabilities in ChatGPT. They offer a new, more intuitive type of interface by allowing you to have a voice conversation or show ChatGPT what you’re talking about. Learn more [here](https://openai.com/blog/chatgpt-can-now-see-hear-and-speak).\n\n\n#### Voice (Beta) is now rolling out to Plus users on iOS and Android\n\n\nYou can now use voice to engage in a back-and-forth conversation with your agent. Speak with it on the go, request a bedtime story, or settle a dinner table debate.\n\n\n\nTo get started with voice, head to Settings → New Features on the mobile app and opt into voice conversations. Then, tap the headphone button located in the top-right corner of the home screen and choose your preferred voice out of five different voices.\n\n\n#### Image input will be generally available to Plus users on all platforms\n\n\nYou can now show ChatGPT one or more images. Troubleshoot why your grill won’t start, explore the contents of your fridge to plan a meal, or analyze a complex graph for work-related data. To focus on a specific part of the image, you can use the drawing tool in our mobile app.\n\n\n\nTo get started, tap the photo button to capture or choose an image. You can also discuss multiple images or use our drawing tool to guide your agent.\n\n\n\n**ChatGPT language support - Alpha on web (September 11, 2023)**\n----------------------------------------------------------------\n\n\nChatGPT now supports a limited selection of languages in the interface: \n\n\n* Chinese (zh-Hans)\n* Chinese (zh-TW)\n* French (fr-FR)\n* German (de-DE)\n* Italian (it-IT)\n* Japanese (ja-JP)\n* Portuguese (pt-BR)\n* Russian (ru-RU)\n* Spanish (es-ES)\n\nIf you've configured your browser to use one of these supported languages, you'll see a banner in ChatGPT that enables you to switch your language settings. You can deactivate this option at any time through the settings menu.\n\n\n\nThis feature is in alpha, requires opting in, and currently can only be used on the web at chat.openai.com. Learn more [here](https://help.openai.com/en/articles/8357869-chatgpt-language-support-beta-web).\n\n\n\nIntroducing ChatGPT Enterprise (August 28, 2023)\n------------------------------------------------\n\n\nToday we’re launching [ChatGPT Enterprise](https://openai.com/blog/introducing-chatgpt-enterprise), which offers enterprise-grade security and privacy, unlimited higher-speed GPT-4 access, longer context windows for processing longer inputs, advanced data analysis capabilities, customization options, and much more. \n\n\n\nChatGPT Enterprise also provides unlimited access to Advanced Data Analysis, previously known as [Code Interpreter](https://openai.com/blog/chatgpt-plugins).\n\n\n\n[Learn more on our website](https://openai.com/enterprise) and connect with our sales team to get started.\n\n\n\nCustom instructions are now available to users in the EU & UK (August 21, 2023)\n-------------------------------------------------------------------------------\n\n\nCustom instructions are now available to users in the European Union & United Kingdom. \n\n\n\nTo add your instructions:\n\n\n* Click on your name\n* Select ‘Custom instructions’\n\nCustom instructions are now available to free users (August 9, 2023)\n--------------------------------------------------------------------\n\n\nCustom instructions are now available to ChatGPT users on the free plan, except for in the EU & UK where we will be rolling it out soon!\n\n\n\nCustomize your interactions with ChatGPT by providing specific details and guidelines for your chats.\n\n\n\nTo add your instructions:\n\n\n* Click on your name\n* Select ‘Custom instructions’\n\nUpdates to ChatGPT (August 3, 2023)\n-----------------------------------\n\n\nWe’re rolling out a bunch of small updates to improve the ChatGPT experience. Shipping over the next week:\n\n\n\n**1. Prompt examples:** A blank page can be intimidating. At the beginning of a new chat, you’ll now see examples to help you get started.\n\n\n**2. Suggested replies:** Go deeper with a click. ChatGPT now suggests relevant ways to continue your conversation.\n\n\n**3. GPT-4 by default, finally:** When starting a new chat as a Plus user, ChatGPT will remember your previously selected model — no more defaulting back to GPT-3.5.\n\n\n**4. Upload multiple files:** You can now ask ChatGPT to analyze data and generate insights across multiple files. This is available with the Code Interpreter beta for all Plus users.\n\n\n**5. Stay logged in:** You’ll no longer be logged out every 2 weeks! When you do need to log in, you’ll be greeted with a much more welcoming page.\n\n\n**6. Keyboard shortcuts:** Work faster with shortcuts, like ⌘ (Ctrl) + Shift + ; to copy last code block. Try ⌘ (Ctrl) + / to see the complete list.\n\n\n\nIntroducing the ChatGPT app for Android (July 25, 2023)\n-------------------------------------------------------\n\n\nChatGPT for Android is now available for download in the United States, India, Bangladesh, and Brazil from the [Google Play Store](https://play.google.com/store/apps/details?id=com.openai.chatgpt).\n\n\n\nWe plan to expand the rollout to additional countries over the next week. You can track the Android rollout [here](https://help.openai.com/en/articles/7947663-chatgpt-supported-countries).\n\n\n\nCustom instructions are rolling out in beta (July 20, 2023)\n-----------------------------------------------------------\n\n\nWe’re starting to roll out custom instructions, giving you more control over ChatGPT’s responses. Set your preferences once, and they’ll steer future conversations. You can read more about custom instructions in the blogpost [here](https://openai.com/blog/custom-instructions-for-chatgpt).\n\n\n\nCustom instructions are available to all Plus users and expanding to all users in the coming weeks.\n\n\n\nTo enable beta features:\n\n\n* Click on 'Profile & Settings’\n* Select 'Beta features'\n* Toggle on 'Custom instructions'\n\nTo add your instructions:\n\n\n* Click on your name\n* Select ‘Custom instructions’\n\nThis feature is not yet available in the UK and EU.\n\n\n\nHigher message limits for GPT-4 (July 19, 2023)\n-----------------------------------------------\n\n\nWe're doubling the number of messages ChatGPT Plus customers can send with GPT-4. Rolling out over the next week, the new message limit will be 50 every 3 hours.\n\n\n\nCode interpreter is now rolling out in beta on web (July 6, 2023)\n-----------------------------------------------------------------\n\n\nWe’re rolling out [code interpreter](https://openai.com/blog/chatgpt-plugins#code-interpreter) to all ChatGPT Plus users over the next week.\n\n\n\nIt lets ChatGPT run code, optionally with access to files you've uploaded. You can ask ChatGPT to analyze data, create charts, edit files, perform math, etc.\n\n\n\nWe’ll be making these features accessible to Plus users on the web via the beta panel in your settings over the course of the next week.\n\n\n\nTo enable code interpreter:\n\n\n* Click on your name\n* Select beta features from your settings\n* Toggle on the beta features you’d like to try\n\nBrowsing is temporarily disabled (July 3, 2023)\n-----------------------------------------------\n\n\nWe've [learned](https://help.openai.com/en/articles/8077698-how-do-i-use-chatgpt-browse-with-bing-to-search-the-web) that the browsing beta can occasionally display content in ways we don't want, e.g. if a user specifically asks for a URL's full text, it may inadvertently fulfill this request. We are temporarily disabling Browse while we fix this.\n\n\n\nBrowsing and search on mobile (June 22, 2023)\n---------------------------------------------\n\n\nWe’ve made two updates to the mobile ChatGPT app:\n\n\n* Browsing: Plus users can now use Browsing to get comprehensive answers and current insights on events and information that extend beyond the model's original training data. To try it out, enable Browsing in the “new features” section of your app settings. Then select GPT-4 in the model switcher and choose “Browse with Bing” in the drop-down.\n* Search History Improvements: Tapping on a search result takes you directly to the respective point in the conversation.\n\n\niOS app available in more countries, shared links in alpha, Bing Plugin, disable history on iOS (May 24, 2023)\n--------------------------------------------------------------------------------------------------------------\n\n\n#### ChatGPT app for iOS in more countries\n\n\nGood news! We’re expanding availability of the [ChatGPT app for iOS](https://openai.com/blog/introducing-the-chatgpt-app-for-ios) to more countries and regions. Users in 11 countries can now download the ChatGPT app in the [Apple App Store](https://apps.apple.com/app/chatgpt/id6448311069) including the United States: Albania, Croatia, France, Germany, Ireland, Jamaica, Korea, New Zealand, Nicaragua, Nigeria, and the United Kingdom.\n\n\n\nWe will continue to roll out to more countries and regions in the coming weeks. You can track the iOS app rollout [here](https://help.openai.com/en/articles/7947663-chatgpt-supported-countries).\n\n\n#### Shared Links\n\n\nWe're excited to introduce a new feature: shared links. This feature allows you to create and share your ChatGPT conversations with others. Recipients of your shared link can either view the conversation or copy it to their own chats to continue the thread. This feature is currently rolling out to a small set of testers in alpha, with plans to expand to all users (including free) in the upcoming weeks.\n\n\n\nTo share your conversations:\n\n\n1. Click on the thread you’d like to share\n2. Select the “Share” button\n3. Click on “Copy Link”\n\n[Learn more](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq).\n\n\n#### Bing Plugin\n\n\nBrowse with Bing. We’ve integrated the browsing feature - currently in beta for paid users - more deeply with Bing. You can now click into queries that the model is performing. We look forward to expanding the integration soon.\n\n\n#### Disable chat history on iOS\n\n\nYou can now disable your chat history on iOS. Conversations started on your device when chat history is disabled won’t be used to improve our models, won’t appear in your history on your other devices, and will only be stored for 30 days. Similar to the functionality on the web, this setting does not sync across browsers or devices. [Learn more](https://help.openai.com/en/articles/7730893-data-controls-faq).\n\n\n\nWeb browsing and Plugins are now rolling out in beta (May 12, 2023)\n-------------------------------------------------------------------\n\n\nIf you are a ChatGPT Plus user, enjoy early access to experimental new features, which may change during development. We’ll be making these features accessible via a new beta panel in your settings, which is rolling out to all Plus users over the course of the next week.\n\n\n\n![](https://downloads.intercomcdn.com/i/o/740734818/c7d818c221f5f023ab1a0c27/BetaPanel.png)Once the beta panel rolls out to you, you’ll be able to try two new features:\n\n\n* **Web browsing**: Try a new version of ChatGPT that knows when and how to browse the internet to answer questions about recent topics and events.\n* **Plugins:** Try a new version of ChatGPT that knows when and how to use third-party plugins that you enable.\n\n\nTo use third-party plugins, follow these instructions:\n\n\n* Navigate to <https://chat.openai.com/>\n* Select “Plugins” from the model switcher\n* In the “Plugins” dropdown, click “Plugin Store” to install and enable new plugins\n\n\nTo enable beta features:\n\n\n1. Click on 'Profile & Settings'\n2. Select 'Beta features'\n3. Toggle on the features you’d like to try\n\nFor more information on our rollout process, please check out the article [here](https://help.openai.com/en/articles/7897380-introducing-new-features-in-chatgpt). \n\n\n\nIn addition to the beta panel, users can now choose to continue generating a message beyond the maximum token limit. Each continuation counts towards the message allowance.\n\n\n\nUpdates to ChatGPT (May 3, 2023)\n--------------------------------\n\n\nWe’ve made several updates to ChatGPT! Here's what's new:\n\n\n* You can now turn off chat history and export your data from the ChatGPT settings. Conversations that are started when chat history is disabled won’t be used to train and improve our models, and won’t appear in the history sidebar.\n* We are deprecating the Legacy (GPT-3.5) model on May 10th. Users will be able to continue their existing conversations with this model, but new messages will use the default model.\n\nIntroducing plugins in ChatGPT (March 23, 2023)\n-----------------------------------------------\n\n\nWe are announcing experimental support for AI plugins in ChatGPT — tools designed specifically for language models. Plugins can help ChatGPT access up-to-date information, run computations, or use third-party services. You can learn more about plugins [here](https://openai.com/blog/chatgpt-plugins).\n\n\n\nToday, we will begin extending plugin access to users and developers from our waitlist. The plugins we are rolling out with are:\n\n\n* Browsing: An experimental model that knows when and how to browse the internet\n* Code Interpreter: An experimental ChatGPT model that can use Python, and handles uploads and downloads\n* Third-party plugins: An experimental model that knows when and how to use external plugins.\n\nYou can join the waitlist to try plugins here:\n\n\n* [ChatGPT Plugin Waitlist](https://share.hsforms.com/16C8k9E5FR5mRLYYkwohdiQ4sk30)\n\nAnnouncing GPT-4 in ChatGPT (March 14, 2023)\n--------------------------------------------\n\n\nWe’re excited to bring GPT-4, our latest model, to our ChatGPT Plus subscribers. \n\n\n\nGPT-4 has enhanced capabilities in:\n\n\n* Advanced reasoning\n* Complex instructions\n* More creativity\n\nTo give every Plus subscriber a chance to try the model, we'll dynamically adjust the cap for GPT-4 usage based on demand. You can learn more about GPT-4 [here](https://openai.com/product/gpt-4).\n\n\n\nFor this release, there are no updates to free accounts.\n\n\n\nUpdates to ChatGPT (Feb 13, 2023)\n---------------------------------\n\n\nWe’ve made several updates to ChatGPT! Here's what's new:\n\n\n* We’ve updated performance of the ChatGPT model on our free plan in order to serve more users.\n* Based on user feedback, we are now defaulting Plus users to a faster version of ChatGPT, formerly known as “Turbo”. We’ll keep the previous version around for a while.\n* We rolled out the ability to purchase [ChatGPT Plus](https://openai.com/blog/chatgpt-plus/) internationally.\n\n\nIntroducing ChatGPT Plus (Feb 9 2023)\n-------------------------------------\n\n\nAs we recently announced, our Plus plan comes with early access to new, experimental features. We are beginning to roll out a way for Plus users the ability to choose between different versions of ChatGPT: \n\n\n* Default: the standard ChatGPT model\n* Turbo: optimized for speed (alpha)\n\nVersion selection is made easy with a dedicated dropdown menu at the top of the page. Depending on feedback, we may roll out this feature (or just Turbo) to all users soon.\n\n\n\nFactuality and mathematical improvements (Jan 30, 2023)\n-------------------------------------------------------\n\n\nWe’ve upgraded the ChatGPT model with improved factuality and mathematical capabilities.\n\n\n\nUpdates to ChatGPT (Jan 9, 2023)\n--------------------------------\n\n\nWe're excited to announce several updates to ChatGPT! Here's what's new:\n\n\n1. We made more improvements to the ChatGPT model! It should be generally better across a wide range of topics and has improved factuality.\n2. Stop generating: Based on your feedback, we've added the ability to stop generating ChatGPT's response\n\n\nPerformance updates to ChatGPT (Dec 15, 2022)\n---------------------------------------------\n\n\nWe're excited to announce several updates to ChatGPT! Here's what's new:\n\n\n1. General performance: Among other improvements, users will notice that ChatGPT is now less likely to refuse to answer questions.\n2. Conversation history: You’ll soon be able to view past conversations with ChatGPT, rename your saved conversations and delete the ones you don’t want to keep. We are gradually rolling out this feature.\n3. Daily limit: To ensure a high-quality experience for all ChatGPT users, we are experimenting with a daily message cap. If you’re included in this group, you’ll be presented with an option to extend your access by providing feedback to ChatGPT.\n\nTo see if you’re using the updated version, look for “ChatGPT Dec 15 Version” at the bottom of the screen.\n\n",
  "title": "ChatGPT — Release Notes",
  "article_id": "6825453",
  "url": "https://help.openai.com/en/articles/6825453-chatgpt-release-notes"
}
