{"text": "OpenAI maintains a [Community Libraries](https://beta.openai.com/docs/libraries/community-libraries) page where we list API clients that developers can use to access the OpenAI API.\n\n\n\nIf you've built an open source library that you'd like added to this page – thank you! We love to see developers build additional API tooling for other developers. We also want to make sure we are steering developers to good solutions that will make them successful long term, so we have a few criteria that we require before listing libraries on our website.\n\n\n\nPlease make sure you meet the criteria listed below, and then fill our our [Community Libraries request form](https://share.hsforms.com/1y0Ixew-rQOOZisFfnhszVA4sk30).\n\n\n1. **Standard open source license**  \nTo be listed, we require that community libraries use a [permissive open-source license](https://choosealicense.com/) such as MIT. This allows our customers to more easily fork libraries if necessary in the event that the owners stop maintaining it or adding features.\n2. **Load API keys through environment variables**  \nCode samples in the README must encourage the use of environment variables to load the OpenAI API key, instead of hardcoding it in the source code.\n3. **Correct, high quality code that accurately reflects the API**  \nCode should be easy to read/follow, and should generally adhere to our [OpenAPI spec](https://github.com/openai/openai-openapi/blob/master/openapi.yaml) – new libraries should **not** include endpoints marked as `deprecated: true` in this spec.\n4. **State that it’s an unofficial library**  \nPlease state somewhere near the top of your README that it’s an “unofficial\" or \"community-maintained” library.\n5. **Commit to maintaining the library**  \nThis primarily means addressing issues and reviewing+merging pull requests. It can also be a good idea to set up Github Issue & PR templates like we have in our [official node library](https://github.com/openai/openai-node/tree/master/.github/ISSUE_TEMPLATE).  \n​\n", "title": "Adding your API client to the Community Libraries page", "article_id": "6684216", "url": "https://help.openai.com/en/articles/6684216-adding-your-api-client-to-the-community-libraries-page"}