{"text": "\n**ChatGPT**\n\n\nPhone verification is no longer required for new OpenAI account creation or ChatGPT usage.\n\n\n\n**API**\n\n\nPhone verification is now mandated on platform.openai.com for generating your initial API key, though not for any subsequent API key generation after that.\n\n\n\n\nWhy do I need to provide my phone number to generate my **first** API key on **platform**.openai.com?\n-----------------------------------------------------------------------------------------------------\n\n\nWhen you generate your first API key on platform.openai.com, we do require a phone number for security reasons. This allows us to verify your account and ensure our platform remains secure. \n\n\n\nYou only need to complete phone verification generating the 1st API key not any subsequent API keys after that.\n\n\n\nWe don't use your phone number for any other purposes, and take your privacy very seriously.\n\n\n\nCan I use a premium number, landline, Google Voice, or other VoIP phone number?\n-------------------------------------------------------------------------------\n\n\nWe do **`not`** support use of `landlines`, `VoIP`, `Google Voice`, or `premium numbers` at this time. All of those types of phone numbers are often associated with higher instances of fraud or abuse.\n\n\n\nFor this reason we only support completing phone verification via mobile phone numbers over an SMS text message, no exceptions.\n\n\n\nHave you always blocked VoIP numbers?\n-------------------------------------\n\n\nYes, we have always blocked VoIP services in the United States to ensure the safety and security of our users. Recently, we have expanded our blocking policy to include VoIP services internationally. This means that VoIP services are now blocked in countries outside the United States as well.\n\n\n\nI don't want to receive the SMS can I phone verify over email/call instead?\n---------------------------------------------------------------------------\n\n\nNo. The phone verification can only be completed with a text message via SMS (or WhatsApp, if available in your country). The code cannot be sent via email or done over phone call.\n\n\n\nWhy am I not receiving my phone verification code SMS?\n------------------------------------------------------\n\n\nIf you're not receiving your phone verification code, it's possible that our system has temporarily blocked you due to too many verification attempts or an issue occurred during your first request.\n\n\n\nPlease try again in a few hours and make sure you're within cellphone coverage, and you're not using any text-blocker applications.\n\n\n\nWhat does this error mean? \"Detected suspicious behavior from phone numbers similar to yours\"\n---------------------------------------------------------------------------------------------\n\n\nThis means our system has detected unusual activity or patterns from phone numbers that are similar to the one you're using for verification. This error is triggered as a security measure to prevent potential fraud or abuse of the platform.\n\n\n\nRemember that security measures like this are in place to protect your account and maintain the integrity of the platform. Ensure that your personal information is accurate and up-to-date.\n\n\n\nHow many times can I use the same phone number to complete the phone verification associated with an OpenAI account's first API key generation?\n-----------------------------------------------------------------------------------------------------------------------------------------------\n\n\nA phone number can only ever be used for phone verification up to 3 times.\n\n\n\nThis means if you have 3 OpenAI accounts you can use the same number for all three when completing phone verification on each initial API key generation across those three accounts.\n\n\n\nFor anti-fraud and abuse reasons, we do **not** allow you to unlink phone numbers from OpenAI accounts to free up that number for reuse. This means deleting an OpenAI account does **not** free up the number to get around the limit. There is no workaround.\n\n\n\nHow do free trial tokens work?\n------------------------------\n\n\nFree trial tokens to API users on platform.openai.com are only given for the first time you sign up then complete phone verification during the first API key generation. No accounts created after that get free trial tokens, no exceptions.\n\n\n\nHow do I resolve I get an error that I can't sign up due to \"unsupported country\"?\n----------------------------------------------------------------------------------\n\n\nThis may be that you're trying to complete phone verification on the initial API key generation on platform.openai.com using a phone number from a country or territory we do not support.\n\n\n\nSee [Supported countries and territories](https://platform.openai.com/docs/supported-countries).\n\n\n\nWhich countries do you support for WhatsApp phone verification?\n---------------------------------------------------------------\n\n\nIn certain countries you can complete phone verification with WhatsApp instead of via an SMS.\n\n\n\nAs of Wednesday, September 27th, 2023 the countries we support for that include:\n\n\n* “IN”, # India\n* “ID”, # Indonesia\n* “PK”, # Pakistan\n* “NG”, # Nigeria\n* “IL”, # Israel\n* “SA”, # Saudi Arabia\n* “AE”, # United Arab Emirates\n* “UA”, # Ukraine\n* “MY”, # Malaysia\n* “TR”, # Turkey\n\n### What will phone verification look like?\n\n\nOur default drop-down is set to the United States which looks like this:\n\n\n![](https://downloads.intercomcdn.com/i/o/658048438/d0ae000cb03c874071cc470a/phone+verification+step+1.png)Then if you select one of the countries in our list above which include the WhatsApp alternative phone verification option - using India as an example - you'll see this UI:\n\n\n![](https://downloads.intercomcdn.com/i/o/658049199/9d36ef51ff688434496e9a60/phone+verification+step+2.png)Then to get your code sent to WhatsApp you can select \"YES\" and that option appears:\n\n\n![](https://downloads.intercomcdn.com/i/o/658049679/e35901be2b3899487a0d7c46/phone+verification+step+3.png)", "title": "Phone verification FAQ", "article_id": "6613520", "url": "https://help.openai.com/en/articles/6613520-phone-verification-faq"}