{"text": "\n### **Deleting your account is permanent can cannot be undone.**\n\n\n**Deleting your account will prevent you from using the account to access OpenAI services, including ChatGPT, API, and DALL·E.** You will NOT be able to create a new account using the same email address. If you delete your account, we will delete your data within 30 days, except we may retain a limited set of data for longer where required or permitted by law. \n\n\n\n**Account Deletion**\n====================\n\n\n**Option 1: Use privacy.openai.com**\n------------------------------------\n\n\nYou can submit requests to delete your account by submitting a request to “delete my data” through [privacy.openai.com](https://privacy.openai.com/policies). On that page you'll click on **Make a Privacy Request** *in the top right corner:*\n\n\n\n![](https://downloads.intercomcdn.com/i/o/930061971/c44535b8da5bff44ad6d0e86/Screenshot+2024-01-10+at+11.30.49%E2%80%AFAM.png)\nThen in the popup that will appear (below) choose **Delete my OpenAI account**:\n\n\n![](https://downloads.intercomcdn.com/i/o/929930246/4ccae9023c591308b39da8ec/Screenshot+2024-01-09+at+2.56.54+PM.png)\n\n**Option 2: Self-serve**\n------------------------\n\n\n1. [Sign in to ChatGPT](https://chat.openai.com/chat)\n2. In the bottom left click on Settings\n3. Free:  \n​\n\n\n![](https://openai.intercom-attachments-7.com/i/o/845964781/3b22386c5e0a934e189dfbfd/8KwrupjnqkkSX2oOHiVdgbxO6yWlb7XtwZoheFdQu1PLzXgQ39gLLurIEjWvoYwVBTrttaHjnDs8GgGeXKR5PiRdp97pr54myEkfN4qhvxFWpGY_OwmGJcWRnBgta1zCw8bW8T4usNO8JBRdjXPl7gQ)\n4. Plus:\n\n\n![](https://openai.intercom-attachments-7.com/i/o/845964790/0a936cd55abd10ffc72e7314/NmprSoTHRT2_T6gfKLzcPrwhvORkEIny1Hc3tbBY0LSunDSh6zUofXEca_7ubsLqC4AcsaSpFmUE_qKgR3ZwRsF0zMLOOkk8jnM0oJn8_dJBBobh5r6tBo0tPUIVgq3_8CBNVR4Chp58RRCZ8T3tAvM)\n5. In the Settings modal click on Data controls\n\n\n![](https://openai.intercom-attachments-7.com/i/o/845964797/96de95d02407226fea1e7831/z1D7-qcFdMg-F14Oz5RAwUv0glyw2tyUtVtwYV-J-47GJ2ZrqdPaEhP4oWksdrc-DbV-EVTMyKMLgmmNrvT5ozzOZn0FZvRaIHLX8GWWov8JxPdevhqVxuRuhhVk7txi0i0Qv9DTn_ZuzZ9e8XCb0VI)\n  \n​\n6. Under Delete account click Delete\n\n\n\t* You may only delete your account if you have logged in within the last 10 minutes.\n\t* If you haven't logged in within the last 10 minutes then you'll see this modal where you need to refresh your login (aka sign in again)\n\n\n![](https://openai.intercom-attachments-7.com/i/o/845964809/2ec57583a8c7ba004e68842e/UWoPCqqR0iyVb83H8FbpQI5IYqIdDZZs3VAuGdNz4QKpweLHSKJDbmherTHn-PL272CZEfTHZTQCDc8j3AlkF0oGw9Z7Jmz9aG84IPyJ_Ovtg-n8IDfrwOQ0Lvwl2x18TPAzkshiibQaQkuSRbAG8SA)\n7. Confirmation modal will appear where you need to type your account email + \"DELETE\" into the input fields to unlock the \"Permanently delete my account\" button\n\n\n\n![](https://openai.intercom-attachments-7.com/i/o/845964813/b0a4ea33e195e827db5434ba/NhaR53ZYFKY8KE1414JY5Giv7nV4hen1ZSSJ-mCHBivLZHxnkbS1Uxkmxkzy7NyRkycq1L8raQ5KxlgQsuat58tW8aEkks2EvUumlDFweY1_soJg4-hg7k8EF9rQEBjo5XnebXQRVi74foWFq-iLS4Q)\n8. Once the inputs are filled out you unlock the \"Permanently delete my account\" button\n\n\n9. Click \"Permanently delete my account\" to delete your account.\n\n\n\n**Common issues**\n=================\n\n\n**Chat retention for deleted vs archived chats**\n------------------------------------------------\n\n\n**Deleted chats** are hard deleted from our systems within 30 days, unless they have been de-identified and disassociated from your account. If you have not [opted out](https://help.openai.com/en/articles/5722486-how-your-data-is-used-to-improve-model-performance), we may use these de-identified chats for training to improve model performance.\n\n\n\n**Archived chats** are retained just like your unarchived chats. Archiving a chat simply removes it from your chat history sidebar. Archived chats can be found and managed in your ChatGPT Settings.\n\n\n\nFor more see **[How chat retention works in ChatGPT](https://help.openai.com/en/articles/8809935-how-chat-retention-works-in-chatgpt).**\n\n\n\n**User content opt-out**\n------------------------\n\n\n**ChatGPT, DALL·E and our other services for individuals**\n\n\nWhen you use ChatGPT, DALL-E, and our other services for individuals, we may use the content you provide to improve model performance. Learn more about your choices on how we use your content to improve model performance [here](https://help.openai.com/en/articles/5722486-how-your-data-is-used-to-improve-model-performance). \n\n\n\n**Enterprise services (such as API and ChatGPT Enterprise)**\n\n\nOpenAI does not train on business data. Learn more about our Enterprise privacy commitments [here](https://openai.com/enterprise-privacy). \n\n\n\n**If I delete my account can I create a new account with the same email?**\n--------------------------------------------------------------------------\n\n\nNo. You cannot create a new account using the same email address.\n\n\n![](https://downloads.intercomcdn.com/i/o/925080821/de3ef0750cb15fbef5602d66/Screenshot+2024-01-04+at+10.40.29%E2%80%AFAM.png)\n**Can I reactivate my account after it's been deleted?**\n--------------------------------------------------------\n\n\nNo. But you can create a new account with a different email address.\n\n\n\nClick “Sign up” on the [ChatGPT login page](https://chat.openai.com/auth/login) or our [API login page](https://platform.openai.com/login). There are a couple caveats of which to be mindful:\n\n\n* Email addresses: **You'll need to use a new email address**.\n\n\n\t+ Since every email address is unique per account, we require a different email address for new accounts. If you don't have an alternative email address, you can try using what's known as an email subaddress: instead of [jane@example.com](mailto:jane@example.com), try [jane+alt@example.com](mailto:jane+alt@example.com). Emails to this address should still go to the same inbox (everything after the + is typically ignored by your email provider), but we'll treat this as a unique email address.\n* Phone numbers: New accounts are still subject to our limit of [3 accounts per phone number](https://help.openai.com/articles/6613520-phone-verification-faq#h_de13bb96c0). Deleted accounts also count toward this limit. Deleting an account does not free up another spot. A phone number can only ever be used up to 3 times for verification to generate the first API key for your account on platform.openai.com.\n\n\n\t+ Phone verification is **not** required to create an OpenAI account.\n\t+ Phone verification is required for a new account to generate their first API key on platform.openai.com.\n\n**We don't support unlinking a phone number from an existing account**\n----------------------------------------------------------------------\n\n\nWe do not allow you to unlink phone numbers from existing accounts.\n\n\n\n\n**How many times can I use my phone number to create OpenAI accounts?**\n-----------------------------------------------------------------------\n\n\nA phone number can only ever be used for phone verification up to 3 times.\n\n\n\nThis means if you have 3 OpenAI accounts you can use the same number for all three when completing phone verification on each initial API key generation across those three accounts.\n\n\n\nFor anti-fraud and abuse reasons, we do **not** allow you to unlink phone numbers from OpenAI accounts to free up that number for reuse. This means deleting an OpenAI account does **not** free up the number to get around the limit. There is no workaround.\n\n\n\nSee our [Phone Verification FAQ](https://help.openai.com/en/articles/6613520-phone-verification-faq).\n\n\n\nCan I change my authentication method after account deletion?\n-------------------------------------------------------------\n\n\n\n⚠️ Deleting your account does **NOT** allow you to change your authentication method.\n\n\nThat said, if you originally signed up for OpenAI / ChatGPT **with an email and password** then in future logins you can choose Google/Apple login allowing users in that situation to then login either way.\n\n", "title": "How to delete your account", "article_id": "6378407", "url": "https://help.openai.com/en/articles/6378407-how-to-delete-your-account"}